In [1]:
person = {
    "first": "Corey", 
    "last": "Schafer", 
    "email": "CoreyMSchafer@gmail.com"
}

In [2]:
people = {
    "first": ["Mark", 'Jane', 'John'], 
    "last": ["Twain", 'Doe', 'Doe'], 
    "email": ["marktwain@mailmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame(people)

In [5]:
df

  first   last                   email
0  Mark  Twain  marktwain@mailmail.com
1  Jane    Doe       JaneDoe@email.com
2  John    Doe       JohnDoe@email.com

In [6]:
df['email']

0    marktwain@mailmail.com
1         JaneDoe@email.com
2         JohnDoe@email.com
Name: email, dtype: object

In [7]:
type(df['email']) #series - row of data (1-d data)

pandas.core.series.Series

In [8]:
df.email #When using this way, column name shouldn't be the same as a method name of dataframe

0    marktwain@mailmail.com
1         JaneDoe@email.com
2         JohnDoe@email.com
Name: email, dtype: object

In [9]:
df[['last','email']] #nested list(2-d)

    last                   email
0  Twain  marktwain@mailmail.com
1    Doe       JaneDoe@email.com
2    Doe       JohnDoe@email.com

In [10]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [11]:
df.iloc[0] #integer location - return series which contain the values of the row

first                      Mark
last                      Twain
email    marktwain@mailmail.com
Name: 0, dtype: object

In [12]:
df.iloc[[0,1]]

  first   last                   email
0  Mark  Twain  marktwain@mailmail.com
1  Jane    Doe       JaneDoe@email.com

In [13]:
df.iloc[[0,1],[2]] #column with index 2 from the rows (here - email)

                    email
0  marktwain@mailmail.com
1       JaneDoe@email.com

In [14]:
df

  first   last                   email
0  Mark  Twain  marktwain@mailmail.com
1  Jane    Doe       JaneDoe@email.com
2  John    Doe       JohnDoe@email.com

In [15]:
df.loc[0]

first                      Mark
last                      Twain
email    marktwain@mailmail.com
Name: 0, dtype: object

In [16]:
df.loc[[0,2],'email']

0    marktwain@mailmail.com
2         JohnDoe@email.com
Name: email, dtype: object

In [17]:
df.loc[[0,2],['email','first']]

                    email first
0  marktwain@mailmail.com  Mark
2       JohnDoe@email.com  John

In [18]:
df

  first   last                   email
0  Mark  Twain  marktwain@mailmail.com
1  Jane    Doe       JaneDoe@email.com
2  John    Doe       JohnDoe@email.com

### Index

In [19]:
# Index - unique value (like primary key)
df.set_index('email',inplace = True) #add inplace = True attribute to make changes in the actual dataframe

In [20]:
df

                       first   last
email
marktwain@mailmail.com  Mark  Twain
JaneDoe@email.com       Jane    Doe
JohnDoe@email.com       John    Doe

In [21]:
df.index

Index(['marktwain@mailmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com'], dtype='object', name='email')

In [22]:
df.loc['marktwain@mailmail.com','first':'last'] #123 won't work anymore, but iloc still works

first     Mark
last     Twain
Name: marktwain@mailmail.com, dtype: object

In [23]:
df.reset_index(inplace = True) #reset index
df

                    email first   last
0  marktwain@mailmail.com  Mark  Twain
1       JaneDoe@email.com  Jane    Doe
2       JohnDoe@email.com  John    Doe

In [24]:
df

                    email first   last
0  marktwain@mailmail.com  Mark  Twain
1       JaneDoe@email.com  Jane    Doe
2       JohnDoe@email.com  John    Doe

In [25]:
df

                    email first   last
0  marktwain@mailmail.com  Mark  Twain
1       JaneDoe@email.com  Jane    Doe
2       JohnDoe@email.com  John    Doe

In [26]:
filt = (df['last'] == 'Doe') #Define a filter

In [27]:
df[filt] #Apply filter to dataframe
df[df['last'] == 'Doe']
df.loc[filt] #Preferred

               email first last
1  JaneDoe@email.com  Jane  Doe
2  JohnDoe@email.com  John  Doe

In [28]:
filt2 = (df['last'] == 'Doe' ) & (df['first'] == 'John')
filt3 = (df['last'] != 'Doe' ) | (df['first'] == 'Mark')

In [29]:
df.loc[filt2,'first':'last']
df.loc[filt3]

                    email first   last
0  marktwain@mailmail.com  Mark  Twain

In [30]:
df.columns

Index(['email', 'first', 'last'], dtype='object')

In [31]:
df.columns = ['first_name','last_name','email']

In [32]:
df.columns = [x.upper() for x in df.columns]
df

               FIRST_NAME LAST_NAME  EMAIL
0  marktwain@mailmail.com      Mark  Twain
1       JaneDoe@email.com      Jane    Doe
2       JohnDoe@email.com      John    Doe

In [33]:
df.columns = [x.lower() for x in df.columns]
df.columns = df.columns.str.replace(' ','_') #Replace space in column names with spaces

In [34]:
df.rename(columns = {'first_name':'first','last_name':'last'},inplace = True)

In [35]:
df.columns = ['email','first','last']
df

                    email first   last
0  marktwain@mailmail.com  Mark  Twain
1       JaneDoe@email.com  Jane    Doe
2       JohnDoe@email.com  John    Doe

In [36]:
df.loc[2] = ['JohnDoe@email.com','John','Smith']
df.loc[2,'last'] = 'Smithian'
df

                    email first      last
0  marktwain@mailmail.com  Mark     Twain
1       JaneDoe@email.com  Jane       Doe
2       JohnDoe@email.com  John  Smithian

In [44]:
df['email'].apply(len)

NameError: name 'upper' is not defined

In [55]:
def update_email(email):
    return email.upper()
df['email'] = df['email'].apply(update_email)
df

                    email first         last
0  MARKTWAIN@MAILMAIL.COM  Mark        Twain
1       JANEDOE@EMAIL.COM  Jane          Doe
2       JOHNDOE@EMAIL.COM  John  Smithsonian

In [57]:
df['email'] = df['email'].apply(lambda x: x.lower())
df

                    email first         last
0  marktwain@mailmail.com  Mark        Twain
1       janedoe@email.com  Jane          Doe
2       johndoe@email.com  John  Smithsonian

In [61]:
df.apply(len)

email    3
first    3
last     3
dtype: int64

In [63]:
df.apply(len,axis = 'columns')

0    3
1    3
2    3
dtype: int64

In [65]:
df.apply(pd.Series.min)

email    janedoe@email.com
first                 Jane
last                   Doe
dtype: object

In [67]:
df.apply(lambda x:x.min())

email    janedoe@email.com
first                 Jane
last                   Doe
dtype: object

In [71]:
df.applymap(len) #applies to each individual value in the dataframe(it's a df funciton not a series function)

   email  first  last
0     22      4     5
1     17      4     3
2     17      4    11

In [76]:
df.applymap(str.lower)

                    email first         last
0  marktwain@mailmail.com  mark        twain
1       janedoe@email.com  jane          doe
2       johndoe@email.com  john  smithsonian

In [78]:
#Map method works on a series
df['first'].map({'Mark':'Chris','Jane':'Mary'})

0    Chris
1     Mary
2      NaN
Name: first, dtype: object